org-mode-init.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>org-mode-init</title>
<!-- 2015-02-04 Wed 10:41 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Toby Tripp" />
<link rel="stylesheet" href="https://maxcdn.bootstrapcdn.com/bootstrap/3.3.2/css/bootstrap.min.css">
<link rel="stylesheet" href="css/htmlize.css">
<link rel="stylesheet" href="css/config.css">
</head>
<body>
<div id="preamble" class="status">
<p><a accesskey="H" href="index.html">HOME</a></p>
</div>
<div id="content">
<h1 class="title">org-mode-init</h1>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Org</h2>
<div class="outline-text-2" id="text-1">
<p>
You're looking at it.
</p>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">Org-Babel</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Fontify code blocks in an Org file:
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #f5deb3;">(</span>setq org-src-fontify-natively t<span style="color: #f5deb3;">)</span>
<span style="color: #f5deb3;">(</span><span style="color: #859900; font-weight: bold;">require</span> '<span style="color: #268bd2; font-weight: bold;">ob</span><span style="color: #f5deb3;">)</span>

<span style="color: #f5deb3;">(</span>add-to-list 'org-babel-tangle-lang-exts '<span style="color: #b58900;">(</span><span style="color: #2aa198;">"clojure"</span> . <span style="color: #2aa198;">"clj"</span><span style="color: #b58900;">)</span><span style="color: #f5deb3;">)</span>
<span style="color: #f5deb3;">(</span>add-to-list 'org-babel-tangle-lang-exts '<span style="color: #b58900;">(</span><span style="color: #2aa198;">"haskell"</span> . <span style="color: #2aa198;">"hs"</span><span style="color: #b58900;">)</span><span style="color: #f5deb3;">)</span>

<span style="color: #f5deb3;">(</span><span style="color: #859900; font-weight: bold;">defun</span> <span style="color: #268bd2;">toby/babel-hook</span> <span style="color: #b58900;">()</span>
            <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">condition-case</span> nil
                <span style="color: #268bd2;">(</span>org-display-inline-images<span style="color: #268bd2;">)</span>
              <span style="color: #268bd2;">(</span><span style="color: #dc322f; font-weight: bold; text-decoration: underline;">error</span> nil<span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #f5deb3;">)</span>

<span style="color: #f5deb3;">(</span>add-hook 'org-babel-after-execute-hook
          'toby/babel-hook
          'append<span style="color: #f5deb3;">)</span>

<span style="color: #f5deb3;">(</span>add-to-list 'org-structure-template-alist
             '<span style="color: #b58900;">(</span><span style="color: #2aa198;">"el"</span>  <span style="color: #2aa198;">"#+BEGIN_SRC emacs-lisp\n?\n#+END_SRC"</span> <span style="color: #2aa198;">"&lt;src lang=\"?\"&gt;\n\n&lt;/src&gt;"</span><span style="color: #b58900;">)</span><span style="color: #f5deb3;">)</span>
<span style="color: #f5deb3;">(</span>add-to-list 'org-structure-template-alist
             '<span style="color: #b58900;">(</span><span style="color: #2aa198;">"hs"</span>  <span style="color: #2aa198;">"#+BEGIN_SRC haskell\n?\n#+END_SRC"</span> <span style="color: #2aa198;">"&lt;src lang=\"?\"&gt;\n\n&lt;/src&gt;"</span><span style="color: #b58900;">)</span><span style="color: #f5deb3;">)</span>
</pre>
</div>

<p>
This adds syntax highlighting to org-babel html exports.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #f5deb3;">(</span>require-package 'htmlize<span style="color: #f5deb3;">)</span>
<span style="color: #f5deb3;">(</span>setq org-export-htmlize-output-type 'css<span style="color: #f5deb3;">)</span>
</pre>
</div>

<p>
To regenerate syntax highlighting CSS (for the active theme):
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #f5deb3;">(</span>org-export-htmlize-generate-css<span style="color: #f5deb3;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">Org Publish</h3>
<div class="outline-text-3" id="text-1-2">
<p>
<a href="http://orgmode.org/worg/org-tutorials/org-publish-html-tutorial.html">Org Publish</a>
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #f5deb3;">(</span>setq org-publish-project-alist
      `<span style="color: #b58900;">(</span><span style="color: #268bd2;">(</span><span style="color: #2aa198;">"Github Site"</span>
         <span style="color: #268bd2; font-style: italic;">:base-directory</span>       ,<span style="color: #dc322f;">(</span>expand-file-name <span style="color: #2aa198;">"~/Code/tobytripp.github.com/org"</span><span style="color: #dc322f;">)</span>
         <span style="color: #268bd2; font-style: italic;">:base-extension</span>       <span style="color: #2aa198;">"org"</span>
         <span style="color: #268bd2; font-style: italic;">:recursive</span>            t
         <span style="color: #268bd2; font-style: italic;">:publishing-function</span>  org-html-publish-to-html
         <span style="color: #268bd2; font-style: italic;">:html-preamble</span> ,<span style="color: #dc322f;">(</span>concat <span style="color: #2aa198;">"&lt;p&gt;&lt;a accesskey=\"H\" href=\"index.html\"&gt;HOME&lt;/a&gt;&lt;/p&gt;"</span><span style="color: #dc322f;">)</span>
         <span style="color: #268bd2; font-style: italic;">:publishing-directory</span> ,<span style="color: #dc322f;">(</span>expand-file-name <span style="color: #2aa198;">"~/Code/tobytripp.github.com/"</span><span style="color: #dc322f;">)</span><span style="color: #268bd2;">)</span>
        <span style="color: #268bd2;">(</span><span style="color: #2aa198;">"emacs-config"</span>
         <span style="color: #268bd2; font-style: italic;">:base-directory</span>       ,org-lib-dir
         <span style="color: #268bd2; font-style: italic;">:base-extension</span>       <span style="color: #2aa198;">"org"</span>
         <span style="color: #268bd2; font-style: italic;">:recursive</span>            t
         <span style="color: #268bd2; font-style: italic;">:publishing-function</span>  org-html-publish-to-html
         <span style="color: #268bd2; font-style: italic;">:htmlized-source</span>      t
         <span style="color: #268bd2; font-style: italic;">:html-preamble</span> ,<span style="color: #dc322f;">(</span>concat <span style="color: #2aa198;">"&lt;p&gt;&lt;a accesskey=\"H\" href=\"index.html\"&gt;HOME&lt;/a&gt;&lt;/p&gt;"</span><span style="color: #dc322f;">)</span>
         <span style="color: #268bd2; font-style: italic;">:publishing-directory</span> ,<span style="color: #dc322f;">(</span>concat dotfiles-dir <span style="color: #2aa198;">"html"</span><span style="color: #dc322f;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #f5deb3;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3">Literate Haskell</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Automatically load and run Haskell code after it's been “tangeled”
(had the source code parsed out into source files).
</p>

<p>
Tangle with:
  C-c C-v t  (org-babel-tangle)
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #f5deb3;">(</span><span style="color: #859900; font-weight: bold;">defun</span> <span style="color: #268bd2;">toby/tangle-and-run</span> <span style="color: #b58900;">()</span>
  <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">cond</span>
   <span style="color: #268bd2;">(</span><span style="color: #dc322f;">(</span>eq 'haskell-mode major-mode<span style="color: #dc322f;">)</span>
    <span style="color: #dc322f;">(</span>message <span style="color: #2aa198;">"Loading tangled buffer in haskell mode!"</span><span style="color: #dc322f;">)</span>
    <span style="color: #dc322f;">(</span>inferior-haskell-load-file<span style="color: #dc322f;">)</span>
    <span style="color: #dc322f;">(</span>switch-to-haskell<span style="color: #dc322f;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #f5deb3;">)</span>

<span style="color: #f5deb3;">(</span>add-hook 'org-babel-post-tangle-hook 'toby/tangle-and-run<span style="color: #f5deb3;">)</span>
<span style="color: #f5deb3;">(</span>define-key org-mode-map <span style="color: #b58900;">(</span>kbd <span style="color: #2aa198;">"&lt;f6&gt;"</span><span style="color: #b58900;">)</span> 'org-babel-tangle<span style="color: #f5deb3;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4">Org-Mode Presentations</h3>
<div class="outline-text-3" id="text-1-4">
<p>
<a href="https://github.com/yjwen/org-reveal">Org-Reveal</a> is an <code>org-mode</code> export extension for creating
presentations with <code>reveal.js</code>.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #f5deb3;">(</span><span style="color: #859900; font-weight: bold;">require</span> '<span style="color: #268bd2; font-weight: bold;">ox-reveal</span><span style="color: #f5deb3;">)</span>
<span style="color: #f5deb3;">(</span>setq org-reveal-root
      <span style="color: #b58900;">(</span>concat <span style="color: #2aa198;">"file://"</span> <span style="color: #268bd2;">(</span>expand-file-name dotfiles-dir<span style="color: #268bd2;">)</span>
              <span style="color: #2aa198;">"html/js/reveal.js-3.0.0/js/reveal.js"</span><span style="color: #b58900;">)</span><span style="color: #f5deb3;">)</span>

<span style="color: #f5deb3;">(</span>add-hook 'org-mode-hook
          <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">lambda</span> <span style="color: #268bd2;">()</span>
            <span style="color: #586e75;">;; </span><span style="color: #586e75;">(load-library "ox-reveal")</span>
            <span style="color: #268bd2;">(</span>local-set-key <span style="color: #dc322f;">(</span>kbd <span style="color: #2aa198;">"s-r"</span><span style="color: #dc322f;">)</span> 'org-babel-tangle<span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #f5deb3;">)</span>

<span style="color: #f5deb3;">(</span><span style="color: #859900; font-weight: bold;">defadvice</span> <span style="color: #268bd2;">org-html-src-block</span>
  <span style="color: #b58900;">(</span>after toby/wrap-org-html-src-in-code-tag activate<span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span>setq ad-return-value <span style="color: #268bd2;">(</span>replace-regexp-in-string
                         <span style="color: #2aa198;">"</span><span style="color: #2aa198; font-weight: bold;">\\</span><span style="color: #2aa198; font-weight: bold;">(</span><span style="color: #2aa198;">&lt;pre[</span><span style="color: #839496;">^</span><span style="color: #2aa198;">&gt;]+src-</span><span style="color: #2aa198; font-weight: bold;">\\</span><span style="color: #2aa198; font-weight: bold;">(</span><span style="color: #2aa198;">[</span><span style="color: #839496;">^</span><span style="color: #2aa198;">\"]+</span><span style="color: #2aa198; font-weight: bold;">\\</span><span style="color: #2aa198; font-weight: bold;">)</span><span style="color: #2aa198;">\"&gt;</span><span style="color: #2aa198; font-weight: bold;">\\</span><span style="color: #2aa198; font-weight: bold;">)</span><span style="color: #2aa198; font-weight: bold;">\\</span><span style="color: #2aa198; font-weight: bold;">(</span><span style="color: #2aa198;">[</span><span style="color: #839496;">^</span><span style="color: #2aa198;">&lt;]+</span><span style="color: #2aa198; font-weight: bold;">\\</span><span style="color: #2aa198; font-weight: bold;">)</span><span style="color: #2aa198;">&lt;/pre&gt;"</span>
                         <span style="color: #2aa198;">"\\1&lt;code class=\"\\2\"&gt;\\3&lt;/code&gt;&lt;/pre&gt;"</span>
                         ad-return-value<span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #f5deb3;">)</span>

<span style="color: #f5deb3;">(</span>setq reveal-highlight-theme <span style="color: #2aa198;">"zenburn"</span><span style="color: #f5deb3;">)</span>

<span style="color: #f5deb3;">(</span><span style="color: #859900; font-weight: bold;">defadvice</span> <span style="color: #268bd2;">org-reveal-stylesheets</span>
  <span style="color: #b58900;">(</span>after toby/add-highlight-styles <span style="color: #268bd2;">(</span>info<span style="color: #268bd2;">)</span> activate<span style="color: #b58900;">)</span>
  <span style="color: #2aa198; font-style: italic;">"Add stylesheet declaration for highlight.js formatting"</span>
  <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">let*</span> <span style="color: #268bd2;">(</span><span style="color: #dc322f;">(</span>root-path <span style="color: #cb4b16;">(</span>plist-get info <span style="color: #268bd2; font-style: italic;">:reveal-root</span><span style="color: #cb4b16;">)</span><span style="color: #dc322f;">)</span>
         <span style="color: #dc322f;">(</span>css-path <span style="color: #cb4b16;">(</span>concat root-path <span style="color: #2aa198;">"/plugin/highlight/styles"</span><span style="color: #cb4b16;">)</span><span style="color: #dc322f;">)</span><span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span>setq ad-return-value
          <span style="color: #dc322f;">(</span>concat ad-return-value
                  <span style="color: #cb4b16;">(</span>format <span style="color: #2aa198;">"&lt;link rel=\"stylesheet\" href=\"%s\"&gt;\n"</span>
                          <span style="color: #268bd2;">(</span>concat css-path <span style="color: #2aa198;">"/"</span> reveal-highlight-theme <span style="color: #2aa198;">".css"</span><span style="color: #268bd2;">)</span><span style="color: #cb4b16;">)</span><span style="color: #dc322f;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #f5deb3;">)</span>
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Toby Tripp</p>
<p class="date">Created: 2015-02-04 Wed 10:41</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
